app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is how I learned to make Rails apps."], ["created_at", Mon, 27 Jan 2014 20:08:57 UTC +00:00], ["title", "Code Rails"], ["updated_at", Mon, 27 Jan 2014 20:08:57 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)
    # current_user.posts << @post
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = 822229646  [["title", "Becoming a Web Developer"], ["body", "\nMeans striving for excellence."], ["updated_at", Mon, 27 Jan 2014 20:20:19 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 393743796]]
---
  def destroy
    @post.destroy