app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    @project = Project.new(project_params)
    respond_to do |format|
      format.html do
        if @project.save
---
INSERT INTO "projects" ("created_at", "name", "technologies_used", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 11 Feb 2014 04:35:05 UTC +00:00], ["name", "Doug MacDowell Portfolio"], ["technologies_used", "Ruby, Rails, HTML5, CSS3"], ["updated_at", Tue, 11 Feb 2014 04:35:05 UTC +00:00]]

  def update
    if @project.update_attributes(project_params)
---
UPDATE "projects" SET "name" = ?, "technologies_used" = ?, "updated_at" = ? WHERE "projects"."id" = 703402084  [["name", "My Portfolio"], ["technologies_used", "\nRuby, Rails, Zurb"], ["updated_at", Thu, 13 Feb 2014 20:33:42 UTC +00:00]]

  def destroy
    @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 145475190]]

  def set_project
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "703402084"]]